#01.12.24
neme_bot = "алиса"
print(f"здравствуйте меня зовут {neme_bot}")
neme_user = input("как тебя звать ")
print(f"приятно позноркомитца {neme_user}")
age_user = int(input("сколько тебе лет? "))
print(f"ого ты уже взрослый тебечерез 10 лет будет {age_user + 10} ")
print(neme_user)
print(age_user)
print(neme_bot)
rise_user = float(input("какой у тебя рост? "))
print(f"мой рост 0.54 метра ты выше меня на  {rise_user - 0.54} метра ")
print(f"...")
print(f"мне очень приятно познокмоится и я узнала о тебе очень много на пример твоё имя {neme_user}. Тебе {age_user} лет и твой рост {rise_user} " )
print(f"""я могу раскозать
1.анигдот
2.стих
3.цитату""")
answer = int(input("выбери 1 2 или 3"))
if answer==1:
    answer_one = int(input("""выбери анигдот на тему
1- разговор в купэ
2- разговор с незнокомцам 
ваш ответ:
"""))
    if answer_one==1:
        print("""В купе вагона пожилая женщина обращается к атлетически сложенному попутчику:
— Молодой человек, вы не могли бы освободить для меня нижнюю полку?
— Могу! Вам в каком купе?""")
    else:
        print(""""— Давай просто полежим молча. В тишине.
— Кто вы?!
— Ну вот, ты всё испортила.
""")
elif answer==2:
    print("""Свинья под Дубом вековым
Наелась желудей досыта, до отвала;
Наевшись, выспалась под ним;
Потом, глаза продравши, встала
И рылом подрывать у Дуба корни стала.

«Ведь это дереву вредит, —
Ей с Дубу Ворон говорит, —
Коль корни обнажишь, оно засохнуть может».
«Пусть сохнет, — говорит Свинья, —
Ничуть меня то не тревожит,
В нем проку мало вижу я;
Хоть век его не будь, ничуть не пожалею;
Лишь были б желуди: ведь я от них жирею».

«Неблагодарная! — примолвил Дуб ей тут, —
Когда бы вверх могла поднять ты рыло,
Тебе бы видно было,
Что эти желуди на мне растут».
                
Невежда так же в ослепленье
Бранит науку и ученье
И все ученые труды,
Не чувствуя, что он вкушает их плоды""")
elif answer==3:
    answer_two = int(input("""цытату на кокую тему вы хотите?
1- жизненная
2- учебы
ваш ответ : """))
    if answer_two==1:
        print("""«Жизнь — это то, что с тобой происходит, пока ты строишь планы» (Джон Леннон). 12
«В нашу жизнь приходит радость, когда у нас есть чем заняться, есть кого любить и есть на что надеяться» (Виктор Франкл). 1
«Жизнь слишком коротка, чтобы тратить её на диеты, жадных мужчин и плохое настроение» (Фаина Раневская). 1
«В этой жизни не важно, как ты падаешь. Важно, как ты поднимаешься» (Шэрон Стоун). 1
«Жизнь — это самое редкое, что есть на свете. Большинству людей знакомо только существование» (Оскар Уайльд). 1
«Прожить жизнь можно двумя способами. Один способ — думать, что чудес не бывает. Второй — думать, что всё происходящее есть чудо» (Альберт Эйнштейн). 1
«Если хочешь понять жизнь, то перестань верить тому, что говорят и пишут, а наблюдай и чувствуй» (Антон Чехов). 13
«Вся жизнь есть обучение, и каждый в ней учитель и вечный ученик» (Абрахам Маслоу).""")
    else:
        print ("век живи век учись")
else:
    print("я вас не поняла ")
     
